# Task 19
list_1 = [45, 23, 1, 5, 31] # len()
k = int(input("Введите кол-во сдвигов: ")) % len(list_1)
# print(list_1[begin=0:end=обязательный_парамет:step=+1])
if k == 0:
    print(list_1)
else:
    print(list_1[-k:] + list_1[:len(list_1) - k])


# Задача №21. Решение в группах-----------------------------------------
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# data = [{"V": "S001"}, {"V": "S002"},
#          {"VI": "S001"}, {"VI": "S005"},
#            {"VII": "S005"}, {"V":"S009"},
#              {"VIII":"S007"}]
# set_values = set()
# # print(data[1])
# for i in data:
#     print(i)
#     set_values.add(list(i.values())[0])
# print(set_values)


# Задача №23. Решение в группах-----------------------------------------------------------
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)

